const { cmd } = require("../command");

cmd(
  {
    pattern: "group",
    react: "👥",
    filename: __filename,
  },
  async (rush, mek, m, { from, reply }) => {
    try {
      const groupText = 
`╭━━━ ⚡ *RUSH-TD* ⚡ ━━━╮\n` +
`┃  👥 𝗚𝗥𝗢𝗨𝗣 - 𝗠𝗘𝗡𝗨             ┃\n` +
`┃━━━━━━━━━━━━━━━━━✦\n` +
`╰➤👢𝙺𝚒𝚌𝚔 𝚞𝚜𝚎𝚛 𝚏𝚛𝚘𝚖 𝚐𝚛𝚘𝚞𝚙: .kick\n` +
`╰➤📢 𝚃𝚊𝚐 𝚊𝚕𝚕 𝚐𝚛𝚘𝚞𝚙 𝚖𝚎𝚖𝚋𝚎𝚛𝚜: .tagall\n` +
`╰➤🖼️ 𝚂𝚎𝚝 𝚐𝚛𝚘𝚞𝚙 𝚙𝚛𝚘𝚏𝚒𝚕𝚎 𝚙𝚒𝚌𝚝𝚞𝚛𝚎: .setup\n` +
`╰➤👑 𝙻𝚒𝚜𝚝 𝚊𝚕𝚕 𝚐𝚛𝚘𝚞𝚙 𝚊𝚍𝚖𝚒𝚗𝚜: .admins\n` +
`╰➤➕ 𝙰𝚍𝚍 𝚊 𝚞𝚜𝚎𝚛 𝚝𝚘 𝚝𝚑𝚎 𝚐𝚛𝚘𝚞𝚙: .add\n` +
`╰➤⬆️ 𝙿𝚛𝚘𝚖𝚘𝚝𝚎 𝚞𝚜𝚎𝚛 𝚝𝚘 𝚊𝚍𝚖𝚒𝚗: .promote\n` +
`╰➤⬇️ 𝙳𝚎𝚖𝚘𝚝𝚎 𝚊𝚍𝚖𝚒𝚗 𝚝𝚘 𝚖𝚎𝚖𝚋𝚎𝚛: .demote\n` +
`╰➤⚠️ 𝙰𝚕𝚕𝚘𝚠 𝚎𝚟𝚎𝚛𝚢𝚘𝚗𝚎 𝚝𝚘 𝚜𝚎𝚗𝚍 𝚖𝚎𝚜𝚜𝚊𝚐𝚎 𝚒𝚗 𝚝𝚑𝚎 𝚐𝚛𝚘𝚞𝚙: .open\n` +
`╰➤⚠️ 𝚂𝚎𝚝 𝚐𝚛𝚘𝚞𝚙 𝚌𝚑𝚊𝚝 𝚝𝚘 𝚊𝚍𝚖𝚒𝚗-𝚘𝚗𝚕𝚢 𝚖𝚎𝚜𝚜𝚊𝚐𝚎: .close\n` +
`╰➤♻️ 𝚁𝚎𝚜𝚎𝚝 𝚐𝚛𝚘𝚞𝚙 𝚒𝚗𝚟𝚒𝚝𝚎 𝚕𝚒𝚗𝚔: .revoke\n` +
`╰➤✏️ 𝙲𝚑𝚊𝚗𝚐𝚎 𝚐𝚛𝚘𝚞𝚙 𝚗𝚊𝚖𝚎: .setsubject\n` +
`╰➤📝 𝙲𝚑𝚊𝚗𝚐𝚎 𝚐𝚛𝚘𝚞𝚙 𝚍𝚎𝚜𝚌𝚛𝚒𝚙𝚝𝚒𝚘𝚗: .setdesc\n` +
`╰➤📄𝚂𝚑𝚘𝚠 𝚐𝚛𝚘𝚞𝚙 𝚍𝚎𝚝𝚊𝚒𝚕𝚜: .ginfo\n` +
`╭━━━━━━━━━━━━━━━━━✦\n` +
`┃  📥Made with ❤️ by\n` +
`╰─🔥 RAMESH DISSANAYAKA 🔥
      \n`.trim();

      // Photo eke path eka / url eka denna
      const imageUrl = "https://github.com/rush1617/RUSH-TD/blob/main/images/Alive.png?raw=true"; // <-- Replace with your image URL

      await rush.sendMessage(from, {
        image: { url: imageUrl },
        caption: groupText,
      }, { quoted: mek });

    } catch (err) {
      console.error(err);
      reply("❌ Error generating group.");
    }
  }
);
